Revit.Elements.Views.Sheet.InitSheet(System.String,System.String,Autodesk.Revit.DB.FamilySymbol,System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.View},System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.XYZ})
sheetName:
sheetNumber:
titleBlockFamilySymbol:
views:
locations:

Revit.Elements.Views.Sheet.InternalSetViewsToSheetView(System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.View},System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.XYZ},System.Collections.Generic.List{Autodesk.Revit.DB.Viewport})
This method sets the collection of views with locations to the existing ViewSheet
views:
locations:
currentViewports:

Revit.Elements.Views.Sheet.SetSheetNumber(System.String)
Set the SheetNumber of the Sheet
sheetNumber:
Returns:

Revit.Elements.Views.Sheet.SetSheetName(System.String)
Set the SheetName of the Sheet
sheetName:
Returns:

Revit.Elements.Views.Sheet.Viewports
Get Viewports from a given sheet

Revit.Elements.Views.Sheet.Schedules
Get ScheduleGraphics from a given sheet

Revit.Elements.Views.Sheet.TitleBlock
Get TitleBlocks of the Sheet
The sheet's titleblock.

Revit.Elements.Views.Sheet.ByNameNumberTitleBlockViewsAndLocations(System.String,System.String,Revit.Elements.FamilyType,Revit.Elements.Views.View[],Autodesk.DesignScript.Geometry.Point[])
Create a Revit Sheet.
This method will automatically set the views with locations onto the sheet.
sheetName: Sheet Name as String.
sheetNumber: Sheet Number as String.
titleBlockFamilyType: Titleblock that will be assigned to created Sheet.
views: Views to be placed on Sheet.
locations: View's location on Sheet.
Returns:

Revit.Elements.Views.Sheet.ByNameNumberTitleBlockViewAndLocation(System.String,System.String,Revit.Elements.FamilyType,Revit.Elements.Views.View,Autodesk.DesignScript.Geometry.Point)
Create a Revit Sheet.
This method will automatically set the view with location onto the sheet.
sheetName: Sheet Name as String.
sheetNumber: Sheet Number as String.
titleBlockFamilyType: Titleblock that will be assigned to created Sheet.
view: View to be placed on Sheet.
location: View's location on Sheet.
Returns:

Revit.Elements.Views.Sheet.DuplicateSheet(Revit.Elements.Views.Sheet,System.Boolean,System.Boolean,System.String,System.String,System.String)
Duplicates A Sheet.
sheet: The Sheet to be Duplicated.
duplicateWithContents: Set to true that Duplicate sheet with contents
duplicateWithView: Set to true that Duplicate sheet with views.
viewDuplicateOption: Enter View Duplicate Option: Duplicate, AsDependent or WithDetailing.
prefix:
suffix: When prefix and suffix are both empty, suffix will set a default value - " - Copy".
Returns:

Revit.Elements.Views.Sheet.DuplicateViews
A list that temporarily stores Views generated by Duplicate, will dispose when sheet disposing.